export default {
    lang: {
        choose: 'Выбор языка/Language',
        zhcn: 'Китайский (упрощенный)',
        zhtw: 'Китайский (традиционный, Тайвань)',
        en: 'Английский',
        es: 'Испанский',
        ru: 'Русский',
        changeok: 'Успешно сменить язык',

    },
    btn: {
        ok: 'OK',
        cancel: 'Отмена',
        cont: 'Продолжить'
    },
    menu: {
        upload: 'Загрузить',
        newfolder: 'Новая папка',
        del: 'Удалить',
        up: 'Родительская папка',
        refresh: 'Обновить',
        dfu: 'DFU'
    },
    status: {
        connected: 'Подключено, Версия: ',
        version: 'Версия:',
        mac: 'MAC-адрес:',
        loading: 'загрузка…'
    },
    conn: {
        connect: 'Подключиться',
        connecting: 'Подключение…',
        disconnect: 'Отключиться…',
        consuccess: 'Успешное подключение к Pixl.js!',
        disconnected: 'Pixl.js был отключен!',
        connfailed: 'Ошибка подключения к Pixl.js!'
    },
    labels: {
        name: 'Имя',
        size: 'Размер',
        type: 'Тип',
        remark: 'Примечание'
    },
    contxmenu: {
        del: 'Удалить…',
        rename: 'Переименовать…',
        prop: 'Свойства…',
        format: 'Форматировать…'
    },
    properties: {
        title: 'Свойства',
        remark: 'Примечание',
        entermsg: 'Пожалуйста, введите примечание',
        attrib: 'Атрибуты',
        hide: 'Скрыть',
        errupdate: 'Не удалось обновить свойства!',
        remarktoolong: 'Примечания могут быть длиной до 90 байт!, то есть 90 символов или 30 китайских символов (текущее значение: ',
        remarktoolongend: ' Байт)'
    },
    upload: {
        title: 'Загрузка',
        drag: 'Перетащите файлы сюда или ',
        click: 'нажмите для загрузки.',
        maxsize: 'Общая длина пути к файлу не может превышать 63 байта.',
        maxname: 'Имя файла не может превышать 47 байт.',
        closetitle: 'Подтвердить закрытие?',
        closemessage: 'Закрытие диалога очистит список загрузок и прервёт очередь загрузки.',
        errupload: 'Ошибка загрузки: '
    },
    format: {
        title: 'Форматирование',
        messrow1a: 'Вы уверены, что хотите отформатировать ',
        messrow1b: ' ?',
        messrow2: 'Форматирование приведет к удалению всех данных!',
        messrow3: 'Форматирование может занять около 10 секунд, пожалуйста, подождите.',
        formatok: 'Форматирование завершено!',
        formaterr: 'Ошибка форматирования!: '
    },
    del: {
        title: 'Удаление',
        message: 'Удалить файл: ',
        messageend: ' ?',
        error: 'Ошибка удаления файла!: ',
        deleteok: 'Файл успешно удален!'
    },
    dfumode: {
        title: 'Режим DFU',
        startconfirm: 'Войти в режим DFU?',
        updateconfirm: 'Вход в режим DFU выполнен успешно. Хотите открыть страницу обновления по DFU?',
        updatetitle: 'Режим DFU принят'
    },
    oldfirm: {
        title: 'Советы по обновлению',
        message: 'Версия встроенного ПО вашего устройства слишком низкая. Пожалуйста, обновите последнюю версию ПО перед использованием функции загрузки.'
    },
    newfolder: {
        title: 'Новая папка',
        message: 'Пожалуйста, введите название папки',
        newfoldererr: 'Ошибка создания папки!:'
    },
    rename: {
        title: 'Переименовать',
        message: 'Пожалуйста, введите новое имя файла: ',
        errrename: 'Ошибка переименования!: ',
        nametoolong: 'Максимальная длина пути к файлу не должна превышать 63 байта',
        pathtoolong: 'Максимальная длина имени файла не должна превышать 47 байт'
    },
    drive: {
        message: '(Диск недоступен [код ошибки: ',
        messageend: '])'
    }
}
